[
    {
        "titleEN": "Ray Casting Tests",
        "descriptionEN": "Ray casting tests applied to calculate and simulate shadows against drawn and random generated polygons in real time.",
        "image": "raycast/raycast.png",
        "demo": "/assets/projects/raycast_1.1/index.html",
        "tags": "javascript, ray casting",
        "id": "0",
        "bodyEN":"<h5>A test applying ray casting to achieve varying results</h5><p>Ray casting is a fundamental building block in rendering and game logics while being a simple yet interesting concept. I wanted to play around with it, and ended up with a quite pretty visual effect.<br><br>In ray casting 'rays' are sent outwards from a common point while detecting if a ray collides with anything. These collision points is the information that motivates the whole procedure. For example, in games collision detection can be done with ray casts: if a ray hits something and the distance to this hit point is of certain amount, it can mean a collision has happened or is about to happen. <br><br>I experimented with this, ending up with a nice shadow effect. I recommended checking out the demo and playing around with it! <br><br>The math heavy parts were inspired from different sources, such as <a target='_blank' href='http://geomalgorithms.com/'>Geometry Algorithms</a> and <a href='http://stackoverflow.com' target='_blank'>Stack OverFlow</a>.</p>",
        "date": "2020/09/10",
        "readmore": "<h5>The costs of ray casting</h5><p>The key things when it comes to the cost of ray casting are the amount of rays and the amount of objects each ray checks itself against. The problem is that if your rays are cast at static angles, like one per degree, you might cast way more rays than necessary and the accuracy can be pretty bad. You can up the amount of rays to increase accuracy, but it can get expensive and the system still wouldn't be deterministic.<br><br> I solved this problem by casting rays at each corner of the polygons. Casting three rays per vertex - one directly at the corner and two slightly off - ensures you get a accurate hits on the edge of a polygon (from cast PoV) and accurate hits on objects behind the polygon. As the polygons can overlap, it's also important to find these intersections and treat them as vertices too.<br><br>Casting rays blindly at vertices isn't an end all cure all solution as when the amount of objects grows, the amount of rays grows while also the amount objects to check against per ray grows too. If this effect were to be used in a product it definitely could use some optimizing.</p>  <img alt='Casting rays at vertices and intersections' src='raycast/raycast_example.png'></img>",
        "images": [
            {
                "img": "raycast/raycast_demo2.jpg"
            },
            {
                "img": "raycast/raycast_demo.jpg"
            }
        ],
        "readmoreimages": [
            {
                "img": "raycast/raycast_example.png"
            }
        ],
        "github": "https://github.com/eetusa/raycastTests"
    }, 
    {
        "titleEN": "Destructible Cube World",
        "descriptionEN": "Creating a dynamic world made out of cubes with sophisticated destruction systems.",
        "image": "DestructibleWorld/cube_card.jpg",
        "tags": "Unity, Unreal, C#, C++, Game engine",
        "id": "11",
        "bodyEN":"<h5>A dynamic world out of cubes</h5><p>A dynamic and destructible game world. The world is built out static of single cubes that aren't aware if they are a part of a structure. A sophisticated algorithm recognises when any cubes are without support and should collapse. The same system also collapses cubes in chunks consisting of a warying amount of cubes, making the world's structures seem more conrete than they really are and the world overall more concrete than it really is.<br><br>The system works pretty well and definitely could have been expanded upon. However, it suffers from an inherent problem: a world built from singlular cubes is very expensive and doesn't scale well. At least not without some very smart systems to manage the problem. To get something out of the project after I faced the scaling issues I created the same system on Unity, Unreal Engine 4 and Unreal Engine 5 to compare different game engines. In particular, I wanted to compare how the physics engines perform and how rendering performs.<br><br>Without going into too much detail, what I found out was:</p><ul><li>PhysX (Unity, UE4) very brightly outshines Chaos (UE5) in both quality and performance</li><li>UE5 with Nanite and Lumen perform so well with a higher number of objects and dynamic lightning they seem also magical compared to the rendering performance of Unity and UE4</li><li>Unreal Engine in general handles a large amount of objects better than Unity</li></ul>",
        "date": "2021/10/07",
        "images": [
            {
                "img": "DestructibleWorld/example1.jpg"
            },
            {
                "img": "DestructibleWorld/example2.jpg"
            },
            {
                "img": "DestructibleWorld/example3.jpg"
            },
            {
                "img": "DestructibleWorld/ue4_1.jpg"
            }
            ,
            {
                "img": "DestructibleWorld/ue5_1.jpg"
            }
            ,
            {
                "img": "DestructibleWorld/ue5_2.jpg"
            }
        ],
        "readmore": "<h5>Determining if cubes have support or should collapse</h5><p>The ground seeking algorithm recursively calls nearby cubes until a cube finds ground, and then flags the whole group as static. If no ground has been found and no more cubes are to be found, it means the build has lost support and it collapses. The algorithm has been optimized to see if a nearby group that it is connected to has ground contact, and also to prefer looking downwards, as that is where the ground usually is.<br><br>What could be interesting to add to the algorithm are stress points. Currently a single cube can carry the weight of thousands, but adding a stress system could make the build collapse when too much of it weights on a weak point.</p><img alt='The algorithm prefers downwards' src='DestructibleWorld/algo.jpg'></img>",
        "videoEmbedded": "https://www.youtube.com/embed/dchaSu_SMnc"
        
    },
    {
        "titleEN": "Falling sand system",
        "descriptionEN": "Testing out a simple falling sand system.",
        "image": "sandspiel/sand_card.jpg",
        "tags": "Unity, C#, Falling sand",
        "id": "12",
        "bodyEN":"<h5>A falling sand system</h5><p>Complexity from simplicity. That's the beauty of cellular automaton models and, as such, the beauty of falling sand games too (such as <a target='_blank' href='https://noitagame.com/'>Noita</a>). The idea is to give simple rules to single 'cells', or pixels in our case. When each pixel follow a set of rules surprisingly complex behaviours can occur. I played around a bit with the concept.<br><br>I only got to sand and water (and a 'static' element) before I ran out of time to tinker around with it more. It's decently interesting as is, but could use more elements and more optimization. You can check out the video demo.</p>",
        "date": "2021/05/26",
        "videoEmbedded": "https://www.youtube.com/embed/vbrezCkFj60"
        
    },
    {
        "titleEN": "Remote Start Device For PC",
        "descriptionEN": "An IOT device to start your computer remotely from wherever.",
        "image": "RemoteStartSystem/box_card.jpg",
        "tags": "IOT, Arduino, 3D Printing",
        "id": "9",
        "bodyEN":"<h5>An IOT project for remotely starting your computer</h5><p>I found myself in need of access to files on my home desktop every so often and additionally sometimes wanting the computing power that the desktop has and my laptop doesn't. Instead of solving this in a sensible manner, I wanted to build a device that would help me boot up my desktop remotely.<br><br>The basic idea is that the device acts in the same role as the PC's power button does: if it closes the specific circuit on the motherboard, the computer starts (or shuts down). Physically closing and opening the circuit is done by a relay. The device needs only two functions: 'close the circuit for 1s, then open it' and the same for 5 seconds to have the option for force shutdown. <br><br>The relay is controlled by an <a target='_blank' href='https://www.arduino.cc/en/Guide/MKR1000'>Arduino MKR1000</a>, which acts as a server. As a server, it's simple to control remotely via the internet. I wrote a simple <a target='_blank' href='https://reactnative.dev/'>React Native</a> application that calls the server API.<br><br>I designed a case for the device with <a target='_blank' href='https://www.autodesk.fi/products/fusion-360/overview'>Fusion 360</a> and 3D printed it.</p>",
        "date": "2021/09/11",
        "images": [
            {
                "img": "RemoteStartSystem/box_real.jpg"
            },
            {
                "img": "RemoteStartSystem/box_real2.jpg"
            },
            {
                "img": "RemoteStartSystem/box_cad3.jpg"
            },
            {
                "img": "RemoteStartSystem/remote_client.jpg"
            }
        ],
        "readmore": "<p>The device is connected in paraller with the power button, which means that both the power button and device can function. Installing the device means that instead of connecting the power button wires to the pins on your motherboard, you connect them to the device, and connect wires from the device to where the power button wires would have gone. It also needs a 5V power from an USB connector from the motherboard.<br><br>Overall I found the project to be a refreshing and teaching experience, as I had to revise my electronics and had to learn Arduino and CAD.<br><br>As per most hobby projects - the destination isn't the goal, but the journey.<br><br></p>"
        
    },
    {
        "titleEN": "Calculator",
        "descriptionEN": "A calculator, evaluating the calculation with algorithms using recursion.",
        "bodyEN": "<h5>A calculator using recursive algorithm</h5> <p>I decided to build a calculator as an exercise to learn <span class='text-info'>JavaScript</span>. On top of being a good problem to combine JS and DOM-manipulation, it was a fun exercise in algorithms too. <br><br> The application runs a recursive algorithm on the given calculation, solving from the 'deepest sub-calculation' to the 'surface'. <br><br> Basically, if the calculation is the following: <code><b>5+(4/2)</b></code>, the algorithm solves it in the following steps:</p><ol><li><code>5+<b>(4/2)</b></code></li><li><code><b>&nbsp;&nbsp;(</b>4/2<b>)</b></code></li><li><code><b>&nbsp;&nbsp;&nbsp;4/2</b></code></li><li><code><b>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;2</b></code></li><li><code><b>5+2</b></code></li><li><code><b>7</b></code></li></ol> <p>The app isn't perfect as it has at least one know bug (try entering '+(-)' -- it shouldn't let you enter incorrect inputs) and the ANS feature was added as an afterthought and works like one. Otherwise I'm pretty happy with it, considering the context.</p>",
        "image": "calc/calc.png",
        "demo": "/assets/projects/calculator0.9/index.html",
        "demotext": "If you look at the developer console, you can see the (a bit incoherent, as they were for debugging purposes) stages of the algorithm.",
        "tags": "javascript",
        "id": "1",
        "date": "2020/08/10",
        "github": "https://github.com/eetusa/CalculatorJS"
    },
    {
        "titleEN": "Slide Browser",
        "descriptionEN": "A tool for browsing PowerPoint and PDF-files with the feature to filter pages by text content.",
        "bodyEN": "<h5>A tool to find information from PDF and PowerPoint-files</h5><p> I wanted to find information more effeciently from pdf & ppt files. I decided to make an app for it. <br><br> The program was created with <span class='text-info'>React</span> and <span class='text-info'>Electron</span> with some <span class='text-danger'>Java</span> on the side. A java program pulls the text data from pdf & ppt files and creates a json from the data. It also splits said files to singular pages as images. The app calls this java program to target user defined folders, and then matches up the split pages and text data from the json. This allows the program to filter pages by text content.<br><h6>Features:</h6><ul><li>Browse any amount of pdf and ppt files on the same UI</li><li>Filter pages by text content</li></ul> <p>It was a fun experience to create a desktop app with web technologies.</p>",
        "images": [
            {
                "img": "slidebrowser/slidebrowser.png"
            },
            {
                "img": "slidebrowser/slidebrowser2.png"
            }
        ],
        "image": "slidebrowser/slidebrowser.png",
        "id": "7",
        "video": "slidebrowserNew.webm",
        "tags": "javascript, react, electron, java",
        "date":"2020/11/10",
        "github":"https://github.com/eetusa/SlideBrowser"
    },
    {
        "titleEN": "Chess Engine 0.9",
        "descriptionEN": "A chess engine with complete chess logics, GUI, perft tests and AI.",
        "bodyEN": "<h5>A chess engine with complete logics, GUI and AI</h5><p> I needed to learn C#, so I set out to create a chess engine with a simple AI. I thought it would be a fun project to learn the language while also learning about minimax algorithm, more about chess programming and testing. Especially since I had already done <a target='_blank' href='/projects/ascii_chess'>a chess game</a> in the past I was excited for the opportunity to do it better.<br><br> Current features are: </p><ul><li>Complete chess logics</li><li>Perft testing with automatic result compare with a well known engine, <a target='_blank' href='https://stockfishchess.org/'>Stockfish</a></li><li>Load boards with <a target='_blank' href='https://en.wikipedia.org/wiki/Forsyth%E2%80%93Edwards_Notation'>FEN</a></li><li>Stupid AI (random legal moves)</li><li>AI with minimax algorithm</li></ul><p> Features to be maybe added in the future: </p><ul><li>Minimax algorithm with alpha-beta pruning</li><li>Evaluation of board states with more finesse than calculating piece value</li><li>Optimization of legal move search</li></ul>",
        "images": [
            {
                "img": "chessengine/chess2.png"
            }
        ],
        "image": "chessengine/chess3.png",
        "id": "8",
        "tags": "C#",
        "date":"2021/03/03",
        "github": "https://github.com/eetusa/ChessProject"
    },
    {
        "titleEN": "Circle Collision Test",
        "descriptionEN": "A circle collision simulation made for learning purposes.",
        "bodyEN": "<h5>A circle collision simulation made with pure JavaScript</h5><p> I came up with this challenge for myself to practice <span class='text-info'>JavaScript</span>. The math was inspired by <a target='_blank' href='https://www.vobarian.com/collisions/2dcollisions2.pdf'>Chad Berchek's paper</a>.<br><br>The project was challenging as accurate collisions weren't achieved straight out of the gate with Berchek's paper. Overlapping colliders were causing the collision angles to be off and what solved this was taking the speed of the colliders into account and offsetting the position of the circles in the opposite direction of their velocity vectors by an amount that was dependent on the ratio of their speeds compared to each other and their radiuses. After trial and error I got the collisions working quite nicely, but the circles are still a bit restless. <br><br>The application isn't still optimized properly. The collision check is too broad and as such too expensive. The 'physics' aren't time dependent but <a target='_blank' href='https://developer.mozilla.org/en-US/docs/Web/API/window/requestAnimationFrame'>requestAnimationFrame()</a> dependent, so 'gravity' may vary, so to speak. I should really fix it.</p>",
        "image": "balls/balls.png",
        "demo":"/assets/projects/balls/index.html",
        "demotext":"Click to spawn a ball. Press space to pause physics. Click & drag & throw balls.",
        "tags": "javascript",
        "id": "2",
        "date": "2020/08/20",
        "github": "https://github.com/eetusa/ball_physics"
    },
    {
        "titleEN": "Peek 0.9",
        "descriptionEN": "A Minecraft plugin that gives a toggleable spectator mode with restrictions.",
        "bodyEN": "<h5>A Minecraft plugin for restricted spectator mode</h5> <p>The plugin was built upon the idea of giving a bit more freedom to building without being as game breaking as spectator mode in survival. <br><br>The mod provides a toggleable mode that lets the user fly as in the spectator mode, but with two major restrictions:</p> <ol><li>There's a maximium range on the fly distance.</li><li>When toggled off, the player is returned to their original position.</li></ol><p>These restrictions enable the player to get a wider view of their build or smaller details inside compact builds while not making building or playing easier - in a way.</p>",
        "image": "mine/mine.png",
        "images": [
                    {
                        "img": "mine/mine.png"
                    },
                    {
                        "img": "mine/mine.png"
                    }
                ],
        "video": "minevideo.webm",
        "tags": "java",
        "id": "3",
        "date": "2020/01/04",
        "github":"https://github.com/eetusa/Peek"
    },
    {
        "titleEN": "ASCII Chess",
        "descriptionEN": "A locally played chess game.",
        "bodyEN": "<h5>Java based chess game with ASCII graphics</h5><p>The title is pretty self-explanatory with this one. The game's logic blocks illegal moves, but doesn't recognize checkmate. The program has the features of saving and loading game states.<br><br>A fun little project to try out ASCII graphics and play around with algorithms.</p>",
        "image": "chess/chess.png",
        "tags": "java",
        "id": "5",
        "date":"2019/02/28"
    },
    {
        "titleEN": "ARC Lens",
        "descriptionEN": "Local computer vision applied to analyze ARC Raiders inventory and recommend keeping, selling, or recycling items in real time.",
        "image": "arclens/screenshot_1_cropped.avif",
        "tags": "JS, React, Vite, OpenCV, ONXX, game tooling",
        "id": "13",
        "date":"2026/01/12",
        "images": [
                    {
                        "img": "arclens/screenshot_1.avif"
                    },
                    {
                        "img": "arclens/screenshot_2.avif"
                    }
                ],


"bodyEN": "<h5>ARC Lens</h5><p style='font-style: italic; margin-bottom: 1em;'>Sometimes you spend more time building a tool for a game than you actually spend playing it. Does it add up? No. Does it compute? Pretty fast.</p><p>I built <a target='_blank' href='https://arclens.app'>ARC Lens</a> to solve the inventory management struggle in <a target='_blank' href='https://store.steampowered.com/app/1808500/ARC_Raiders/'>ARC Raiders</a>. Without external tools, it is difficult to know if an item should be sold or saved for a future upgrade.</p><p>The application uses the browser's Screen Sharing API to capture a live feed of the game. It processes the video stream using <a target='_blank' href='https://opencv.org/'>OpenCV</a> & <a target='_blank' href='https://onnx.ai/'>ONNX</a> OCR to detect the item the user is hovering over. It then cross-references the item against the user's current bench levels and active quests to provide an instant 'Keep, Sell, or Recycle' recommendation.</p><p><b>Key Features:</b></p><ul><li><b>Live OCR:</b> Real-time item recognition via browser screen share.</li><li><b>Second Screen Mode:</b> Connect a phone, tablet, or second monitor via WebSocket to act as a dedicated loot dashboard, keeping the main game HUD clutter-free.</li><li><b>Intelligent Decision Engine:</b> Analyzes quest progression to predict exactly which items are needed for upgrades.</li><li><b>Privacy-First Architecture:</b> Game data processing is 100% client-side. Usage stats are tracked anonymously via a self-hosted <a target='_blank' href='https://umami.is/'>Umami</a> instance.</li></ul>",
    "readmore": "<p><b>A fun note:</b> I originally built this as a native Python app where object detection was easy. But I quickly realized that if I wanted anyone to actually use this, it had to be a web app.</p><p>After a quick refactor, I noticed the object recognition was bad. Real bad. What was robust on desktop was flaky on the web, so I had to pivot to a strict 'tooltip detection' strategy just to get a lock on the items.</p><p>Even then, OCR was a headache. <a target='_blank' href='https://tesseract-ocr.github.io/'>Tesseract</a> struggled hard with Roman numerals (distinguishing 'II' and 'III' was a nightmare). I even spent time generating a 60k-image training dataset to fine-tune it. As expected, it made the model worse!</p><p>Moving to <a target='_blank' href='https://onnx.ai/'>ONNX</a> finally got things rolling. It handled multiline text very badly at first, but after tightening the dynamic crop to strictly target the item title, it started spitting out great results directly in the browser.</p><p><b>Going Real-Time:</b> To implement the companion feature, I utilized <a target='_blank' href='https://www.partykit.io/'>PartyKit</a> for the WebSocket infrastructure. The desktop browser acts as the 'host', broadcasting OCR results to a shared room. This allows any secondary device to subscribe and update instantly with low latency.</p><p><b>Analytics:</b> I needed visibility into how users interact with the site and verification that the OCR performs correctly in the wild. I deployed a self-hosted instance of <a target='_blank' href='https://umami.is/'>Umami</a> (running on Vercel & Supabase) to track visitor stats and identification events. This provides the necessary insights while keeping the app cookie-free.</p>"
    }
]

